# KNDashMPerDegreePerM Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KNDashMPerDegreePerM Property
SymbolTypeId Class See Also
---
Symbol kN-m/°/m, indicating unit Kilonewton meters per degree per meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KNDashMPerDegreePerM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KNDashMPerDegreePerM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KNDashMPerDegreePerM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace